//export default 
class Accounting {
    constructor() {
        this.goods = {
            'крупа': {
                "рис круглый": 85,
                "рис длиннозерный пропаренный": 110,
                "нут": undefined,
                "спагетти 450гр": 50,
                "гречка": 48,
                "горох": 42,
                "макаорны": 40,
                "лапша 100гр": 22,
                "фунчоза": 193,
                "геркулес": 63,
                "манная": 51,
            },
            'заморозка': {
                "фасоль": 140,
            },
            'овощи': {
                "картошка": 50,
                "лук": 30,
                "кабачки": 90,
                "баклажан": 180,
                "свекла": 50,
                "капуста": 35,
                "морковь": 50,
                "зелень": 280,
                "помидоры": 140,
                "огурцы": 70,
                "пекинская капуста": 100,
                "чеснок": 300,
                "лук зеленый": 280,
                "лимон": 110,
                "огурцы соленые": 75,
                "лук зеленый": 280,
                "лимон": 110,
                
            },
            'консервы': {
                "горох 400мл": 40,
                "кукуруза 400мл": 57,
                "ананасы 820мл": 135,
                "фасоль 360мл": 40,
                "огурцы соленые": 75,
                "квашеная капуста": undefined,
                "сардины 240гр": 89,
                
            },
            'соус': {
                "томатный 10кг": 1500,
                "майонез 10кг": 1135,
                "соевый 1л": 104,
                "аджика 1кг": 165,
                "кетчуп": 242,
                "бульон куриный": 1197,
                
            },
            'мясные изделия': {
                "грудка": 220,
                "горбуша": 229,
                "окорочка": 200,
                "купаты": 269,
                "филе бедра": 339,
                "филе минтая": 226,
                "язык": 800,
                "пикша": 355,
                "крабовое мясо": 249,
                "говядина лопатка": 540,
                "фарш говяжий": 440,
                "наггетсы": 350,
                "печень говяжья": undefined,
                "печень куриная": undefined,
                "желудки куриные": undefined,
                "котлетная масса куриная": undefined,
                "кордан блю": 370,
            },
            "колбасы": {
                "сосиски": 198,
                "ветчина": 223,
                "полу-копченая колбаса зернистая": 254,
                "Аппетитная колбаса вареная": 185,
            },
            "специи": {
                "сахар": 65,
                "соль": 11,
                "заправка для морковчи": 266,
                "уксус 9%": 35,
                "масло 5л": 444,
                "масло 1л": 80,
                "лимонная кислота": 186,
                "хмели-сунели": 360,
                "сахар порционный": 0.89,
            },
            'молочные продукты': {
                "молоко 0.8л": 39,
                "шантипак": 313,
                "сгущенка": 200,
                "сыр": 355,
                "сыр плавленный 180гр": 42,
                "сметана ": 122,
                "творог": 166,
                "яйца 1шт": 8,
                "маргарин 60%": 137,
                "спред растительно-жировой 72,5%": 148,
            },
            'мучные изделия': {
                "мука": 29,
                "слоеное тесто": 147,
                "дрожжи": 100,
            },
            'хлеб': {
                "хлеб": 36,
                "хлеб тостовый": 66,
                
            },

            "упаковка": {
                "упаковка 500гр": undefined,
                "упаковка 250гр": undefined,
                "упаковка для супа": undefined,
                "пакеты": undefined,
                "салфетки": undefined,
                
                
            },




        };
        this.order = {

        }
        this.goodsStock = {

        }        
        
    }
    

}

const ex = new Accounting()

console.log(ex.goods["мясные изделия"].горбуша)